# MEPFamilyConnectorInfo Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MEPFamilyConnectorInfo Members
MEPFamilyConnectorInfo Class Methods Properties See Also
---
The MEPFamilyConnectorInfo type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | (Inherited from MEPConnectorInfo.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetAssociateFamilyParameterId | Gets the associate family parameter id of the specified connector parameter id. |
| GetConnectorParameterValue | Gets the parameter value of the specified connector parameter id. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsPrimary | True if this is the primary connector.  (Inherited from MEPConnectorInfo.) |
| IsSecondary | True if this is the secondary connector.  (Inherited from MEPConnectorInfo.) |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from MEPConnectorInfo.) |
| LinkedConnector | The linked connector or nullNothingnullptra null reference (Nothing in Visual Basic) if there is no linked connector  (Inherited from MEPConnectorInfo.) |

# See Also
MEPFamilyConnectorInfo Class
Autodesk.Revit.DB Namespace